#slice 요소 할당
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:5] = ['a','b','c'] #인덱스 2부터 4까지 값 할당
print(a)

a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:5] = ['a']    # 인덱스 2부터 4까지에 값 1개를 할당하여 요소의 개수가 줄어듦
print(a)

a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:5] = ['a', 'b', 'c', 'd', 'e'] #인덱스 2부터 4까지 값 5개를 할당하여 요소 개수가 늘어남
print(a)

#증가폭을 활용한 슬라이스
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:8:2] = ['a', 'b', 'c']    # 인덱스 2부터 2씩 증가시키면서 인덱스 7까지 값 할당
print(a)

#슬라이스 삭제
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
del a[2:5]    # 인덱스 2부터 4까지 요소를 삭제
print(a)

#증가폭을 활용한 슬라이스 삭제
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
del a[2:8:2]    # 인덱스 2부터 2씩 증가시키면서 인덱스 6까지 삭제
print(a)
