# 핵심 정리 3

# 문자열 서식 지정자

'%서식지정자' % 값                  # 서식 지정자 한 개 사용
'I am %s.' % 'maria'                # 'I am maria.'
 
'%서식지정자1, %서식지정자2' % (값1, 값2)    # 서식 지정자 여러 개 사용
'Today is %d %s.' % (3, 'April')             # 'Today is 3 April.'

'%.자릿수f' % 숫자    # 소수점 이하 자릿수 지정하기
'%.3f' % 2.3            # '2.300'

%길이s     # 문자열을 지정된 길이로 만든 뒤 오른쪽으로 정렬하고 남는 공간을 공백으로 채움
'%10s' % 'python'     # '    python'
 
%-길이s    # 문자열을 지정된 길이로 만든 뒤 왼쪽으로 정렬하고 남는 공간을 공백으로 채움
'%-10s' % 'python'    # 'python    '

'%0개수d' % 숫자    # 자릿수에 맞춰서 0이 들어감
'%03d' % 1          # '001'
 
'%0개수.자릿수f' % 숫자    # 실수의 소수점 이하 자릿수 지정
'%08.2f' % 3.6             # '00003.60'

# 문자열 포매팅

'{0}'.format(값)                      # 값을 한 개 넣음
'{0} {1}'.format(값1, 값2)            # 값을 두 개 넣음
'{0} {0} {1} {1}'.format(값1, 값2)    # 같은 인덱스에는 같은 값이 들어감
'{} {} {}'.format(값1, 값2, 값3)      # 인덱스를 생략하면 format에 지정한 순서대로 값이 들어감
'{name1} {name2}'.format(name1=값1, name2=값2)    # { }에 이름을 지정

변수1, 변수2 = 값1, 값2
f'{변수1} {변수2}'

'{인덱스:<길이}'.format(값)  # 문자열을 지정된 길이로 만든 뒤 왼쪽 정렬, 남는 공간을 공백으로 채움
'{인덱스:>길이}'.format(값)  # 문자열을 지정된 길이로 만든 뒤 오른쪽 정렬, 남는 공간을 공백으로 채움

'{인덱스:0개수d}'.format(숫자)          # 자릿수에 맞춰서 0이 들어감
'{인덱스:0개수.자릿수f'}.format(숫자)    # 실수의 소수점 이하 자릿수 지정

'{인덱스:[[채우기]정렬][길이][.자릿수][자료형]}'
 
'{0:0<10}'.format(15)       # '1500000000': 길이 10, 왼쪽으로 정렬하고 남는 공간은 0으로 채움
'{0:0>10.2f}'.format(15)    # '0000015.00': 길이 10, 오른쪽으로 정렬하고 소수점 이하 자릿수는 2자리
 
'{0: >10}'.format(15)    # '        15': 남는 공간을 공백으로 채움
'{0:>10}'.format(15)     # '        15': 채우기 부분을 생략하면 공백이 들어감
'{0:x>10}'.format(15)    # 'xxxxxxxx15': 남는 공간을 문자 x로 채움
