# 2차원 리스트 생성

a = [[10, 20], [30, 40], [50, 60]]
print(a)

# 리스트의 요소에 접근하기

a = [[10, 20], [30, 40], [50, 60]]

print(a[0][0]) # 세로 인덱스 0, 가로 인덱스 0인 요소 출력

print(a[1][1]) # 세로 인덱스 1, 가로 인덱스 1인 요소 출력

print(a[2][1]) # 세로 인덱스 2, 가로 인덱스 0인 요소 출력

print(a[0][1]) # 세로 인덱스 0, 가로 인덱스 1인 요소 출력

a[0][1] = 1000 # 세로 인덱스 0, 가로 인덱스 1인 요소에 값 할당

print(a[0][1]) # 세로 인덱스 0, 가로 인덱스 1인 요소 출력

# 톱니형 리스트(jagged list) 생성

a = [[10, 20],
     [500, 600, 700],
     [9],
     [30, 40],
     [8],
     [800, 900, 1000]]

# 동적으로 톱니형 리스트 생성

a = []
a.append([])
a[0].append(10)
a[0].append(20)
a.append([])
a[1].append(500)
a[1].append(600)
a[1].append(700)
print(a)
[[10, 20], [500, 600, 700]]
